lorcan35/TinkerTab/sdkconfig.defaults
# TinkerClaw Tab5 — ESP32-P4 defaults (Phase 1.5)
# Matched to M5Stack Tab5 BSP sdkconfig

# Target
CONFIG_IDF_TARGET="esp32p4"

# Flash — Tab5 has 16MB QIO flash
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Compiler — performance optimized
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# PSRAM — 200MHz, XIP enabled (critical for MIPI DSI framebuffer DMA)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y

# L2 Cache — 256KB with 128-byte lines (needed for DSI video streaming)
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# Larger main task stack (display + LVGL + all driver inits need room)
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# FreeRTOS tick rate
CONFIG_FREERTOS_HZ=1000

# Partition table — custom for 16MB flash (4MB app + 12MB storage)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# USB console (JTAG/serial)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Experimental features (required for some MIPI DSI APIs)
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# ---------------------------------------------------------------------------
# ESP-Hosted — ESP32-C6 WiFi co-processor via SDIO
# Requires ESP-IDF v5.4.3+ for PSRAM XIP + TCM stack fixes
# ---------------------------------------------------------------------------
# Tab5 SDIO pin mapping (different from P4 EV Board defaults!)
CONFIG_ESP_HOSTED_SDIO_PIN_CLK=12
CONFIG_ESP_HOSTED_SDIO_PIN_CMD=13
CONFIG_ESP_HOSTED_SDIO_PIN_D0=11
CONFIG_ESP_HOSTED_SDIO_PRIV_PIN_D1_4BIT_BUS=10
CONFIG_ESP_HOSTED_SDIO_PIN_D2=9
CONFIG_ESP_HOSTED_SDIO_PIN_D3=8
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=15
# Tab5 C6 reset is active LOW (confirmed from M5Stack UserDemo sdkconfig)
CONFIG_ESP_HOSTED_SDIO_RESET_ACTIVE_LOW=y
# Slave target is ESP32-C6
CONFIG_ESP_HOSTED_IDF_SLAVE_TARGET="esp32c6"
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y

# ---------------------------------------------------------------------------
# WiFi credentials and Dragon server (overridable via menuconfig)
# ---------------------------------------------------------------------------
CONFIG_TAB5_WIFI_SSID="Sawaya-2.4G"
CONFIG_TAB5_WIFI_PASS="Jx3dzz8t///"
CONFIG_TAB5_DRAGON_HOST="192.168.1.89"
CONFIG_TAB5_DRAGON_PORT=3501

# ---------------------------------------------------------------------------
# LVGL Configuration
# ---------------------------------------------------------------------------
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_36=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_USE_LOG=y
CONFIG_LV_LOG_LEVEL_WARN=y
CONFIG_LV_THEME_DEFAULT_DARK=y

# ---------------------------------------------------------------------------
# Crash diagnostics and stability
# ---------------------------------------------------------------------------
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
CONFIG_ESP_COREDUMP_MAX_TASKS_NUM=64
CONFIG_ESP_COREDUMP_CHECKSUM_CRC32=y
CONFIG_ESP_COREDUMP_ENABLE_TO_NONE=
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_HEAP_POISONING_LIGHT=y
CONFIG_HEAP_POISONING_DISABLED=
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096

# ---------------------------------------------------------------------------
# lwIP — IP reassembly for UDP JPEG streaming (large datagrams)
# ---------------------------------------------------------------------------
CONFIG_LWIP_IP_REASSEMBLY=y
CONFIG_LWIP_IP_REASS_MAX_PBUFS=64

# ---------------------------------------------------------------------------
# Memory — reserve more internal RAM for DMA (SDIO WiFi needs it)
# Default 32KB is too little when voice + streaming run concurrently
# ---------------------------------------------------------------------------
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536
